Repository: FontManager/font-manager
Catalog: help/*/*.po
Languages: ar, de

# _
source: translator-credits
ar: خالد حسني <khaledhosny@eglug.org>، ٢٠١٦
de: Milo Ivir <mail@milotype.de>, 2019, 2020

source: Automatically generated categories
de: Automatisch erstellte Kategorien

source: Categories
de: Kategorien

source: <app>Font Manager</app> automatically categorizes your fonts based on various properties.
de: <app>Font Manager</app> kategorisiert Schriften automatisch anhand verschiedener Eigenschaften.

source: All
de: Alle

source: All available fonts.
de: Alle verfügbare Schriften.

source: Fonts available to all users.
de: Für alle Benutzer verfügbare Schriften.

source: User
de: Benutzer

source: Fonts available only to you.
de: Nur für Dich verfügbare Schriften.

source: Family Kind
de: Familienart

source: Sorted by Family Kind — Requires Panose information to be present in font metadata.
de: Gruppiert nach Familienart – Panose-Informationen müssen in den Metadaten des Fonts enthalten sein.

source: Width
de: Breite

source: Sorted by font width property.
de: Gruppiert nach Schriftbreite.

source: Weight
de: Stärke

source: Sorted by font weight property.
de: Gruppiert nach Strichstärke.

source: Slant
de: Neigung

source: Sorted by font slant property.
de: Gruppiert nach Schriftwinkel.

source: Spacing
de: Dickte

source: Sorted by font spacing property.
de: Gruppiert nach Laufweite.

source: License
de: Lizenz

source: Sorted by font license — Requires license information to be present in font metadata.
de: Gruppiert nach Lizenz – Lizenz-Informationen müssen in den Metadaten des Fonts enthalten sein.

source: Vendor
de: Hersteller

source: Sorted by font vendor — Requires vendor information to be present in font metadata.
de: Gruppiert nach Hersteller – Hersteller-Informationen müssen in den Metadaten des Fonts enthalten sein.

source: Filetype
de: Dateityp

source: Sorted by file format.
de: Gruppiert nach Dateiformat.

source: Unsorted
de: Unsortiert

source: Fonts not present in any of your collections.
de: Schriften die sich in keiner Sammlung befinden.

source: Disabled
de: Deaktiviert

source: Currrently disabled font families.
de: Momentan deaktivierte Schriftfamilien.

source: View individual characters and their details
de: Anzeige einzelner Zeichen und ihrer Details

source: Character Map
de: Zeichentabelle

source: While in "Manage" mode the preview pane contains a tab labeled "Characters".
de: Im Modus „Verwalten“ enthält das Vorschaufenster ein Register mit der Bezeichnung „Zeichentabelle“.

source: Selecting this tab allows viewing all glyphs contained in the currently selected font.
de: Die Auswahl dieser Registerkarte ermöglicht die Anzeige aller Glyphen, die in der aktuell ausgewählten Schriftart enthalten sind.

source: <app>Character Map tab</app>
de: <app>Zeichentabelle Register</app>

source: Drag characters onto other applications to use them.
de: Ziehe Zeichen auf andere Anwendungen, um sie zu verwenden.

source: Organizing Your Fonts
de: Schriften organisieren

source: Collections
de: Sammlungen

source: <app>Font Manager</app> allows you to define your own collections.
de: <app>Font Manager</app> ermöglicht es eigenen Sammlungen zu definieren.

source: Collections allow you to organize your fonts in a way that makes sense to you and also make it easier to enable or disable many families at once.
de: Sammlungen ermöglichen es Schriften nach Lust und Laune zu organisieren, und erleichtern es, mehrere Familien gleichzeitig zu aktivieren und zu deaktivieren.

source: Collections do not modify your files in any way.
de: Sammlungen verändern deine Dateien in keiner Weise.

source: Feel free to create or delete as many as you like.
de: Erstelle oder lösche sie nach Bedarf.

source: Select the Collection view at the bottom of the sidebar.
de: Wähle die Sammlungen-Ansicht in der Seitenleiste.

source: To create a new collection:
de: Um eine neue Sammlung zu erstellen:

source: Click <gui> <media type="image" src="media/list-add-symbolic.svg"/> </gui> at the top of the Collection view.
de: Klicke oben in der Sammlungen-Ansicht auf <gui> <media type="image" src="media/list-add-symbolic.svg"/> </gui>.

source: Enter a name for your new collection
de: Trage den Namen der neuen Sammlung ein

source: Switch back to Category view.
de: Gehe zurück auf Kategorien-Ansicht.

source: Add fonts by dragging them from the font list to your new collection.
de: Füge Schriften hinzu, indem du sie aus der Schriftenliste in deine neue Sammlung ziehst.

source: Note : The sidebar will automatically switch to collections from categories while dragging fonts.
de: Hinweis: beim Ziehen von Schriften, wechselt die Seitenleiste von Kategorien automatisch zu Sammlungen.

source: To delete a collection:
de: Um eine Sammlung zu löschen:

source: Select the collection
de: Wähle eine Sammlung

source: Click <gui> <media type="image" src="media/list-remove-symbolic.svg"/> </gui> at the top of the Collection view.
de: Klicke oben in der Sammlungen-Ansicht auf <gui> <media type="image" src="media/list-remove-symbolic.svg"/> </gui>.

source: To enable a collection:
de: Um eine Sammlung zu aktivieren:

source: Click the <gui style="checkbox"> checkbox </gui>
de: Klicke auf das <gui style="checkbox"> Kontrollkästchen </gui>

source: To disable a collection:
de: Um eine Sammlung zu deaktivieren:

source: To remove families from a collection:
de: Um Schriftfamilien aus einer Sammlung zu entfernen:

source: Select the family or families you wish to remove
de: Wähle die Schriftfamilie oder -familien aus, die du entfernen möchtest

source: Click the <gui> <media type="image" src="media/list-remove-symbolic.svg"/> </gui> at the top of the font list.
de: Klicke oberhalb der Schriftenliste auf <gui> <media type="image" src="media/list-remove-symbolic.svg"/> </gui>.

source: To rename a collection:
de: Um eine Sammlung umzubenennen:

source: Select a collection, click it again
de: Wähle eine Sammlung, klicke nochmal auf sie

source: Enter a new name
de: Trage den neuen Namen ein

source: Press <gui style="button">Enter</gui>
de: Drücke die Taste <gui style="button">Eingabe</gui>

source: Activating and De-activating font families
de: Aktivieren und Deaktivieren von Schriftfamilien

source: Activation
de: Aktivieren

source: <app>Font Manager</app> allows you to activate and de-activate font families.
de: <app>Font Manager</app> ermöglicht es Schriftfamilien zu aktivieren und zu deaktivieren.

source: If you have a large number of fonts installed, font selection dialogs and lists in many applications can get very long and become uncomfortable to use, disabling fonts you do not use very often or do not need at the moment helps keep these at a reasonable size.
de: Wenn du eine große Anzahl von Schriften installiert hast, können Schriftauswahl-Dialoge und -Listen in vielen Anwendungen sehr lang und unkomfortabel werden. Das Deaktivieren von Schriften, die du nicht sehr oft verwendest oder im Moment nicht benötigst, hilft, die Schriftenlisten auf einer vernünftigen Größe zu halten.

source: To enable or disable a font family:
de: Um eine Schriftfamilie zu aktivieren oder zu deaktivieren:

source: Select the family you wish to enable/disable in the font list
de: Wähle in der Schriftenliste die Familie aus, die du aktivieren oder deaktivieren möchtest

source: You can also double-click, press <gui style="button">Space</gui> or press <gui style="button">Enter</gui> to toggle the selected font.
de: Um die ausgewählte Schrift zu aktivieren oder zu deaktivieren doppelklicke sie, drücke die <gui style="button">Leertaste</gui>, oder drücke die <gui style="button">Eingabetaste</gui>.

source: <link xref="organize#user-collections">Collections</link> make it easy to enable or disable multiple families at once.
de: <link xref="organize#user-collections">Sammlungen</link> erleichtern es, mehrere Familien gleichzeitig zu aktivieren und zu deaktivieren.

source: While any changes made using <app>Font Manager</app> are applied immediately, open applications may need to be restarted in order to reflect those changes.
de: Während alle mit <app>Font Manager</app> vorgenommenen Änderungen sofort übernommen werden, müssen geöffnete Anwendungen möglicherweise neu gestartet werden, um diese Änderungen zu berücksichtigen.

source: Adding fonts for your use
de: Schriften zum Eigengebrauch hinzufügen

source: Installation
de: Installationsanweisungen

source: <app>Font Manager</app> supports the most common <link xref="supported-formats">font formats</link>.
de: <app>Font Manager</app> unterstützt die gebräuchlichsten <link xref="supported-formats">Schriftformate</link>.

source: While in <gui style="button">Manage</gui> mode
de: Im Modus <gui style="button">Verwalten</gui>

source: Click <gui style="button"> <media type="image" src="media/list-add-symbolic.svg"/> </gui> at the top of the window
de: Klicke oben im Fenster auf <gui style="button"> <media type="image" src="media/list-add-symbolic.svg"/> </gui>

source: Select the files you wish to install from the file selector dialog that is displayed and click <gui style="button">Open</gui>
de: Wähle die Dateien die du aus dem angezeigten Dateiauswahldialog installieren möchtest und klicke auf <gui style="button">Öffnen</gui>

source: Drag and drop is also supported. Simply drag files onto the font list to install them.
de: Ziehen-und-loslassen wird ebenfalls unterstützt. Ziehe Dateien auf die Schriftenliste, um sie zu installieren.

source: You can drag any supported filetype onto the font list. This includes font files, directories and archives.
de: Alle unterstützten Dateitypen können auf die Schriftenliste gezogen werden. Dazu gehören Schriftdateien, Verzeichnisse und Archive.

source: Install <link action="install:file-roller" href="https://wiki.gnome.org/Apps/FileRoller">Archive Manager</link>. to enable support for compressed files.
de: Installiere <link action="install:file-roller" href="https://wiki.gnome.org/Apps/FileRoller">Archive Manager</link>, um die Unterstützung für komprimierte Dateien zu aktivieren.

source: <app>Font Manager</app> will reload anytime changes require it. This may take a moment depending on number of changes.
de: <app>Font Manager</app> wird neu geladen, wenn Änderungen dies erfordern. Dies kann je nach Anzahl der Änderungen einen Moment dauern.

source: Getting rid of unwanted fonts
de: Unerwünschte Schriften loswerden

source: Removal
de: Entfernen

source: The only fonts listed in the removal dialog will be those installed in your default font directory.
de: Die einzigen Schriften, die im Dialogfeld zum Entfernen aufgeführt werden, sind die im Standardschriftenverzeichnis installierte Schriften.

source: Font files installed system wide are typically installed as part of the operating system, as packages or by the system administrator. <app>Font Manager</app> does not provide for removal of such files at this time.
de: Systemweit installierte Schriftdateien werden normalerweise als Teil des Betriebssystems, als Pakete oder vom Systemadministrator installiert. <app>Font Manager</app> ermöglicht es zur Zeit nicht solche Dateien zu entfernen.

source: To remove fonts you no longer need:
de: Um Schriften zu entfernen die du nicht mehr benötigst:

source: Click <gui style="button"> <media type="image" src="media/list-remove-symbolic.svg"/> </gui> at the top of the window
de: Klicke oben im Fenster auf <gui style="button"> <media type="image" src="media/list-remove-symbolic.svg"/> </gui>

source: Select the families or individual styles you wish to remove from the list that is displayed
de: Wähle aus der angezeigten Liste Familien oder einzelne Stile aus, die du entfernen möchtest

source: Click <gui style="button">Delete</gui>
de: Klicke auf <gui style="button">Entfernen</gui>

source: <app>Font Manager</app> organizes and stores installed fonts in the default user font directory.
de: <app>Font Manager</app> organisiert und speichert installierte Schriften im Standard-Benutzerverzeichnis für Schriften.

source: Current default user font directory is located at <code><file>~/.local/share/fonts</file></code>
de: Das aktuelle Standard-Benutzerverzeichnis für Schriften befindet sich unter <code><file>~/.local/share/fonts</file></code>

source: Files are permanently deleted. Before removing any fonts ensure you have backups if there is a chance you may need them again.
de: Die Dateien werden dauerhaft gelöscht. Bevor du Schriften entfernst, stelle sicher, dass du Sicherungskopien hast, falls du sie eventuell nochmal benötigen solltest.

source: Adding and removing font directories
de: Schriften-Verzeichnisse hinzufügen und entfernen

source: Sources
de: Quellen

source: <app>Font Manager</app> allows you to add or remove directories to scan for font files. Added directories are scanned recursively.
de: <app>Font Manager</app> ermöglicht es Verzeichnisse hinzuzufügen oder sie zu entfernen, um nach Schriftdateien zu suchen. Hinzugefügte Verzeichnisse werden rekursiv durchsucht.

source: This allows keeping font files somewhere other than your home directory or temporarily "installing" a directory of fonts.
de: Dies ermöglicht es, Schriftdateien an einem anderen Ort als dem Home-Verzeichnis aufzubewahren, oder ein Schriften-Verzeichnis vorübergehend zu „installieren“.

source: It also allows you to organize your font files anyway you like.
de: Es ermöglicht auch, Schriftdateien nach Bedarf zu organisieren.

source: To add a source:
de: Um eine Quelle hinzuzufügen:

source: Open the <app>Font Manager</app> preferences dialog by clicking <gui> <media type="image" src="media/preferences-system-symbolic.svg"/> </gui> at the top of the window.
de: Öffne das Fenster der <app>Font Manager</app> Einstellungen, indem du oben im Fenster auf <gui> <media type="image" src="media/preferences-system-symbolic.svg"/> </gui> klickst.

source: Select "Sources" from the sidebar
de: Wähle „Quellen“ in der Seitenleiste

source: Click <gui> <media type="image" src="media/list-add-symbolic.svg"/> </gui>
de: Klicke auf <gui> <media type="image" src="media/list-add-symbolic.svg"/> </gui>

source: Select the directory you wish to add from the file selector that is displayed
de: Wähle das Verzeichnis das du hinzufügen möchtest

source: To remove a source:
de: Um eine Quelle zu entfernen:

source: Select the directory you wish to remove from the list that is displayed
de: Wähle das Verzeichnis das du aus der angezeigten Liste entfernen möchtest

source: Click <gui> <media type="image" src="media/list-remove-symbolic.svg"/> </gui>
de: Klicke <gui> <media type="image" src="media/list-remove-symbolic.svg"/> </gui>

source: To enable or disable a source:
de: Um eine Quelle zu aktivieren oder zu deaktivieren:

source: Open the <app>Font Manager</app> preferences dialog by clicking <gui style="button"> <media type="image" src="media/preferences-system-symbolic.svg"/> </gui> at the top of the window.
de: Öffne das Fenster der <app>Font Manager</app> Einstellungen, indem du oben im Fenster auf <gui style="button"> <media type="image" src="media/preferences-system-symbolic.svg"/> </gui> klickst.

source: Select the source you want to enable or disable
de: Wähle die Quelle die du aktivieren oder deaktivieren möchtest

source: Click the <gui> toggle switch </gui>
de: Klicke auf den <gui> Schalter </gui>

source: While sources are always available within the application they are not available to other applications until they are enabled.
de: Während die Quellen immer innerhalb der Anwendung verfügbar sind, stehen sie anderen Anwendungen nicht zur Verfügung, bis sie aktiviert werden.

source: You can avoid having multiple copies of the same files by adding directories from other filesystems.
de: Vermeide es, mehrere Kopien derselben Dateien zu haben, indem du Verzeichnisse aus anderen Dateisystemen hinzufügst.

source: Generate fontconfig configuration files
de: Generiere fontconfig-Konfigurationsdateien

source: Display and Rendering Preferences
de: Einstellungen für die Anzeige und Wiedergabe

source: The "Display" and "Rendering" panes in the preferences dialog generate valid fontconfig configuration files for the exposed properties.
de: Die Bereiche „Anzeige“ und „Wiedergabe“ im Einstellungsdialog erzeugen gültige fontconfig-Konfigurationsdateien für die ausgestellten Eigenschaften.

source: See <link href="https://www.freedesktop.org/software/fontconfig/fontconfig-user.html">fonts-conf</link> for more details.
de: Für weitere Einzelheiten, siehe <link href="https://www.freedesktop.org/software/fontconfig/fontconfig-user.html">fonts-conf</link>.

source: Desktop environments and applications may rely on their own configuration mechanism.
de: Desktop-Umgebungen und -Anwendungen greifen möglicherweise auf ihren eigenen Konfigurationsmechanismus zurück.

source: Introduction to <app>Font Manager</app>.
de: Einführung in <app>Font Manager</app>.

source: <app>Font Manager</app> allows you to :
de: <app>Font Manager</app> Features:

source: Introduction
de: Einführung

source: Preview font files in various ways
de: Verschiedene Vorschaumöglichkeiten von Schriftdateien

source: View available font metadata
de: Anzeige von verfügbaren Schrift-Metadaten

source: Install or remove fonts for your use
de: Schriften für den eigenen Gebrauch installieren oder entfernen

source: Group fonts into "Collections"
de: Schriften in „Sammlungen“ gruppieren

source: Enable or disable individual font families or entire collections
de: Einzelne Schriftfamilien oder ganze Sammlungen aktivieren oder deaktivieren

source: Specify different directories to use for fonts
de: Eigene Schriften-Verzeichnisse bestimmen

source: Perform font substitution
de: Schrift-Ersetzungen

source: For more information about <app>Font Manager</app>, please visit the <link href="http://fontmanager.github.io/"> Homepage </link>
de: Für weitere Informationen über <app>Font Manager</app> besuche die <link href="http://fontmanager.github.io/"> Homepage </link>

source: To report a bug or make a suggestion regarding the <app>Font Manager</app> application or this manual, please use the projects <link href="https://github.com/FontManager/master/issues"> Issue Tracker </link>
de: Um einen Fehler zu melden oder einen Vorschlag bezüglich <app>Font Manager</app> oder dieses Handbuchs zu machen, benutze unser System zur <link href="https://github.com/FontManager/master/issues"> Verfolgung von Problemen </link>

source: View license information contained in font files
de: Anzeige der Lizenzinformationen in den Schriftdateien

source: Licensing
de: Lizensierung

source: While in "Manage" mode the preview pane contains a tab labeled "License".
de: Im Modus „Verwalten“ enthält das Vorschaufenster ein Register mit der Bezeichnung „Lizenz“.

source: Selecting this tab allows viewing any licensing information contained in the currently selected font.
de: Die Auswahl dieser Registerkarte ermöglicht die Anzeige aller Lizenzinformationen, die in der aktuell ausgewählten Schriftart enthalten sind.

source: <app>Font License tab</app>
de: <app>Schriften-Lizenz Register</app>

source: Not all font files contain licensing information.
de: Nicht alle Schriftdateien enthalten Lizenzinformationen.

source: View metadata embedded in your font files
de: Anzeige eingebauter Metadaten in den Schriftdateien

source: Metadata
de: Metadaten

source: While in "Manage" mode the preview pane contains a tab labeled "Properties".
de: Im Modus „Verwalten“ enthält das Vorschaufenster ein Register mit der Bezeichnung „Eigenschaften“.

source: Selecting this tab allows viewing metadata contained in the currently selected font.
de: Die Auswahl dieser Registerkarte ermöglicht die Anzeige aller Metadaten, die in der aktuell ausgewählten Schriftart enthalten sind.

source: <app>Font Properties tab</app>
de: <app>Schrift-Eigenschaften Register</app>

source: Some properties are optional and may not be present in all font files.
de: Einige Eigenschaften sind optional und möglicherweise nicht in allen Schriftdateien vorhanden.

source: View languages supported and their coverage
de: Anzeige unterstützter Sprachen und ihrer Abdeckung

source: Language Support
de: Sprachunterstützung

source: While the character map is in use the sidebar will switch to displaying the orthographies supported by the currently selected font.
de: Während die Zeichentabelle verwendet wird, wechselt die Seitenleiste zur Anzeige der Rechtschreibungen, die von der aktuell ausgewählten Schriftart unterstützt werden.

source: Selecting an orthography from the list will filter the character map so that it only displays relevant characters
de: Mit der Auswahl einer Rechtschreibung aus der Liste wird die Zeichentabelle so gefiltert, dass nur relevante Zeichen angezeigt werden

source: <app>Supported Orthographies</app>
de: <app>Unterstützte Rechtschreibungen</app>

source: Substitute one font family for another
de: Ersetze eine Schriftfamilie mit einer anderen

source: Substitution
de: Ersetzung

source: <app>Font Manager</app> allows you to substitute one font family for another.
de: <app>Font Manager</app> ermöglicht es eine Schriftfamilie mit einer anderen zu ersetzen.

source: To add a substitute:
de: Um eine Ersetzung hinzuzufügen:

source: Select "Substitutions" from the sidebar
de: Wähle „Ersetzungen“ in der Seitenleiste

source: Click <gui> <media type="image" src="media/list-add-symbolic.svg"/> </gui> in the substitutions pane.
de: Klicke im Bereich Ersetzungen auf <gui> <media type="image" src="media/list-add-symbolic.svg"/> </gui>.

source: Enter the name of the font family you wish to set up a substitute for.
de: Trage den Namen der Schriftfamilie ein, für die du die Ersetzung eingerichten möchtest.

source: Click <gui> <media type="image" src="media/list-add-symbolic.svg"/> </gui> on the right.
de: Klicke <gui> <media type="image" src="media/list-add-symbolic.svg"/> </gui> auf der rechten Seite.

source: Enter the name of the substitute family and select the priority level.
de: Trage den Namen der Ersatzfamilie ein und wähle die Prioritätsstufe.

source: Repeat steps 3 – 6 as needed.
de: Wiederhole Schritte 3 bis 6 nach Bedarf.

source: Click <gui style="button">Save</gui> to write the configuration file when done.
de: Klicke auf <gui style="button">Speichern</gui>, um die Konfigurationsdatei zu schreiben.

source: To remove a substitute:
de: Um eine Ersatzschrift zu entfernen:

source: Select the entry you wish to remove from the list.
de: Wähle den Eintrag den du aus der Liste entfernen möchten.

source: Click <gui> <media type="image" src="media/list-remove-symbolic.svg"/> </gui> in the substitutions pane.
de: Klicke im Bereich Ersetzungen auf <gui> <media type="image" src="media/list-remove-symbolic.svg"/> </gui>.

source: To remove all substitutes:
de: Um Ersatzschriften zu entfernen:

source: Click <gui style="button"> Discard </gui> in the substitutions pane.
de: Klicke im Bereich Ersetzungen auf <gui style="button"> Verwerfen </gui>.

source: Fonts matching the target family are edited to prepend the list of preferred families before the matching family, append the acceptable families after the matching family and append the default families to the end of the family list.
de: Schriften, die der Zielfamilie entsprechen, werden so bearbeitet, dass sie in die Liste der bevorzugten Familien hinzugefügt werden, und zwar vor die entsprechende Familie. Die akzeptablen Familien werden nach der entsprechenden Familie angehängt und die Standardfamilien ans Ende der Familienliste.

source: While changes are applied immediately open applications may need to be restarted.
de: Während Änderungen sofort übernommen werden, müssen geöffnete Anwendungen möglicherweise neu gestartet werden.

source: Font formats supported by <app>Font Manager</app>.
de: Schriftformate, die <app>Font Manager</app> unterstützt.

source: Supported File Formats
de: Unterstützte Dateiformate
