Repository: FontManager/font-manager
Catalog: help/*/*.po
Languages: ar, de

source: Getting started with Font Manager.
de: Erste Schritte mit Font Manager.

source: GNU General Public License Version 3
de: GNU Allgemeine öffentliche Lizenz Version 3

source: Managing Your Fonts
de: Eigene Schriften verwalten

source: Getting to Know Your Fonts
de: Schriften kennenlernen

source: Advanced Features
de: Erweiterte Funktionen

# text
source: Font Manager
ar: مدير الخطوط

source: Simple font management for GTK+ desktop environments
ar: إدارة بسيطة للخطوط لبيئات سطح مكتك جتك+

source: <link href="http://www.gnu.org/licenses/gpl-3.0-standalone.html">GNU General Public License Version 3</link>
ar: <link href="http://www.gnu.org/licenses/gpl-3.0-standalone.html">رخصة جنو العمومية إصدارة ٣</link>

source: <media type="image" mime="image/png" src="media/logo.png">Font Manager logo</media> Font Manager
ar: <media type="image" mime="image/png" src="media/logo.png">شعار مدير الخطوط</media> مدير الخطوط

source: Help has not been implemented yet.
ar: المساعدة لم تُكتب بعد.

source: If you would like to help this project by providing help documentation please see <link href="http://projectmallard.org"> Project Mallard </link> for more information.
ar: إذا كنت ترغب في مساعدة هذا المشروع بالعمل على التوثيق فرجاء راجع <link href="http://projectmallard.org">مشروع مالرد</link> لمزيد من المعلومات.

source: If you do decide to help, please file an issue at <link href="https://github.com/FontManager/master/issues">https://github.com/FontManager/master/issues</link> detailing what you intend to work on.
ar: إذا قررت المساعدة، فرجاء افتح مسألة في <link href="https://github.com/FontManager/master/issues">https://github.com/FontManager/master/issues</link> توضح فيها ما الذي تريد العمل عليه.

source: Thank you.
ar: شكرا

source: Localization
ar: التوطين
