Repository: FontManager/font-manager
Catalog: po/*.po
Languages: uk

source: Easily substitute one font family for another.
uk: Легко замінюйте одне сімейство шрифтів іншим.

source: To add a new substitute click the add button in the toolbar.
uk: Щоб додати нову заміну, натисніть кнопку додати на панелі інструментів.

source: Actions defined here will be added to the font list context menu. By default the filepath for the selected font will be appended to the end of the argument list. To control where the filepath is inserted use FILEPATH as a placeholder. If FAMILY or STYLE are found in the argument list they will also be replaced.
uk: Визначені тут дії буде додано до контекстного меню списку шрифтів. За замовчуванням шлях до файлу для вибраного шрифту буде додано в кінець списку аргументів. Щоб керувати місцем вставлення шляху до файлу, використовуйте FILEPATH як заповнювач. Якщо в списку аргументів знайдено FAMILY або STYLE, їх також буде замінено.

source: User Actions
uk: Дії користувача

source: Custom context menu entries
uk: Записи контекстного меню користувача

source: Selected setting requires restart to apply
uk: Щоб застосувати вибране налаштування, потрібен перезапуск

source: Changes will take effect next time the application is started
uk: Зміни набудуть чинності під час наступного запуску програми

source: Wide Layout
uk: Широкий макет

source: Use three column layout
uk: Використовуйте макет у три колонки

source: Only When Maximized
uk: Лише при розгорнутому

source: Enable Animations
uk: Увімкнути анімацію

source: Prefer Dark Theme
uk: Віддавайте перевагу темній темі

source: Use Adwaita Stylesheet
uk: Використовуйте таблицю стилів Adwaita

source: Raised
uk: Піднятий

source: Flat
uk: Плоский

source: Titlebar Button Style
uk: Стиль кнопки заголовка

source: Display line size in Waterfall Preview
uk: Розмір лінії відображення в попередньому перегляді водоспаду

source: Waterfall Line Spacing
uk: Водоспад Міжрядковий інтервал

source: Padding in pixels to insert above and below rows
uk: Відступ у пікселях для вставки над і під рядками

source: Fonts in any folders listed here will be available within the application. They will not be visible to other applications until the source is actually enabled.
uk: Шрифти з будь-яких папок, перелічених тут, будуть доступні в програмі. Вони не будуть видимі для інших програм, доки джерело не буде фактично ввімкнено.

source: Easily add or preview fonts without actually installing them.
uk: Легко додавайте або переглядайте шрифти, не встановлюючи їх.

source: To add a new source simply drag a folder onto this area or click the add button in the toolbar.
uk: Щоб додати нове джерело, просто перетягніть папку в цю область або натисніть кнопку «Додати» на панелі інструментів.

source: Network Access Disabled
uk: Доступ до мережі вимкнено

source: Contact your system administrator to request access.
uk: Зверніться до системного адміністратора, щоб отримати доступ.

source: Network Offline
uk: Мережа офлайн

source: An active internet connection is required to access the Google Fonts catalog
uk: Для доступу до каталогу шрифтів Google потрібне активне підключення до Інтернету

source: Client Error
uk: Помилка клієнта

source: Try restarting the application. If the issue persists, please file a bug.
uk: Спробуйте перезапустити програму. Якщо проблема не зникає, повідомте про помилку.

source: Server Error
uk: Помилка сервера

source: Adlam
uk: Відскок

source: Anatolian Hieroglyphs
uk: Анатолійські ієрогліфи

source: Avestan
uk: Авестійська

source: Bassa Vah
uk: Басса Вах

source: Batak
uk: Батак

source: Bhaiksuki
uk: Байксукі

source: Brahmi
uk: Брахмі

source: Braille
uk: Брайля

source: Caucasian Albanian
uk: Кавказький албанець

source: Canadian Aboriginal
uk: Канадський абориген

source: Chinese (Hong Kong)
uk: Китайська (Гонконг)

source: Chinese (Simplified)
uk: Китайська (спрощена)

source: Chinese (Traditional)
uk: Китайська (традиційна)

source: Chorasmian
uk: Хоразмійський

source: Cuneiform
uk: Клинопис

source: Cypriot
uk: Кіпрський

source: Cypro Minoan
uk: Кіпромінойська

source: Cyrillic
uk: Кирилиця

source: Cyrillic Extended
uk: Розширена кирилиця

source: Deseret
uk: Десерет

source: Duployan
uk: Дуплоян

source: Elbasan
uk: Ельбасан

source: Elymaic
uk: Елімейський

source: Grantha
uk: Гранта

source: Greek
uk: Грецька

source: Greek Extended
uk: Грецька розширена

source: Gunjala Gondi
uk: Гунджала Гонді

source: Hanifi Rohingya
uk: Ханіфі рохінджа

source: Hanunoo
uk: Хануну

source: Imperial Aramaic
uk: Імперська арамейська

source: Indic Siyaq Numbers
uk: Індійські номери Siyaq

source: Inscriptional Pahlavi
uk: Напис пехлеві

source: Inscriptional Parthian
uk: Написовий парфянський

source: Japanese
uk: Японський

source: Kawi
uk: Каві

source: Khojki
uk: Хойкі

source: Khudawadi
uk: Худаваді

source: Korean
uk: Корейська

source: Latin
uk: Латинь

source: Latin Extended
uk: Латинська розширена

source: Linear A
uk: Лінійний А

source: Linear B
uk: Лінійний Б

source: Lisu
uk: Лісу

source: Lycian
uk: Лікійський

source: Lydian
uk: Лідійський

source: Mahajani
uk: Махаджані

source: Mandaic
uk: Мандаїк

source: Manichaean
uk: Маніхейський

source: Math
uk: Матем

source: Marchen
uk: Маршень

source: Masaram Gondi
uk: Масарам Гонді

source: Mayan Numerals
uk: Числа майя

source: Medefaidrin
uk: Медефаїдрін

source: Meetei Mayek
uk: Маяк Маутек

source: Meroitic
uk: Мероїтичний

source: Modi
uk: Моді

source: Multani
uk: Зброя

source: Music
uk: Музика

source: Nabataean
uk: Набатейський

source: Nag Mundari
uk: Наг Мундарі

source: Nandinagari
uk: Нандінагар

source: Newa
uk: Нева

source: Nüshu
uk: Нюшу

source: Old Hungarian
uk: Староугорська

source: Old North Arabian
uk: Старий північноаравійський

source: Old Permic
uk: Старопермський

source: Old Persian
uk: Староперська

source: Old Sogdian
uk: старосогдійський

source: Old Turkic
uk: Старотюрк

source: Osage
uk: Осейдж

source: Pahawh Hmong
uk: Пахавх Хмонг

source: Palmyrene
uk: Пальмірен

source: Pau Cin Hau
uk: Пау Син Хау

source: Phoenician
uk: Фінікійський

source: Psalter Pahlavi
uk: Псалтир Пехлеві

source: Samaritan
uk: Самарянин

source: Sharada
uk: Хвороба

source: Shavian
uk: Шавіан

source: Siddham
uk: Сідхем

source: SignWriting
uk: Знакове письмо

source: Sogdian
uk: Согдійський

source: Sora Sompeng
uk: Сора Сомпенг

source: Soyombo
uk: Сойомбо

source: Tagalog
uk: Тагальська

source: Tagbanwa
uk: Тагбанва

source: No sample for %s available
uk: Немає доступних зразків для %s

source: Please file an issue requesting an update to available samples.
uk: Надішліть запит на оновлення доступних зразків.

source: %i Language Sample Available
uk: %i Зразок мови доступний

source: ExtraLight
uk: Надлегкий

source: SemiBold
uk: Напівжирний

source: ExtraBold
uk: Наджирний

source: Black
uk: Чорний

source: System Font
uk: Системний шрифт

source: Selected font file is either installed in a system directory or is not writable by the current user. If you wish to remove this font from the list of available fonts use the system package manager to remove the package containing this font file, ask the system administrator to remove it or use a font management application to disable it.
uk: Вибраний файл шрифту встановлено в системному каталозі або недоступний для запису поточним користувачем. Якщо ви хочете видалити цей шрифт зі списку доступних шрифтів, скористайтеся системним менеджером пакетів, щоб видалити пакет, що містить цей файл шрифту, попросіть системного адміністратора видалити його або скористайтеся програмою керування шрифтами, щоб вимкнути його.

source: Newer version already installed
uk: Новіша версія вже встановлена

source: Click to overwrite
uk: Натисніть, щоб перезаписати

source: Update Font
uk: Оновити шрифт

source: Remove Font
uk: Видалити шрифт

source: Install Font
uk: Встановити шрифт

source: Preview Area Colors
uk: Кольори області попереднього перегляду

source: Select background color
uk: Виберіть колір фону

source: Select text color
uk: Виберіть колір тексту

source: General
uk: Загальний

source: Increase preview size
uk: Збільшити розмір попереднього перегляду

source: Decrease preview size
uk: Зменшити розмір попереднього перегляду

source: Reset preview size
uk: Скинути розмір попереднього перегляду

source: Focus search entry
uk: Перейти до запису пошуку

source: Reload
uk: Перезавантажити

source: Quit the application
uk: Закрийте програму

source: Mode
uk: Режим

source: Switch to Manage mode
uk: Перейдіть у режим керування

source: Switch to Browse mode
uk: Перейдіть у режим перегляду

source: Switch to Compare mode
uk: Перейдіть у режим порівняння

source: Switch to Google Fonts mode
uk: Перейдіть у режим Google Fonts

source: Preview Mode
uk: Режим попереднього перегляду

source: Switch to Standard preview
uk: Перейти до стандартного попереднього перегляду

source: Switch to Waterfall preview
uk: Переключитися на попередній перегляд водоспаду

source: Switch to Body Text preview
uk: Перейти до попереднього перегляду основного тексту

source: Increase tile size
uk: Збільшити розмір плитки

source: Decrease tile size
uk: Зменшити розмір плитки

source: Toggle search entry
uk: Перемкнути пошуковий запис

source: Toggle preview panel
uk: Перемкнути панель попереднього перегляду

source: Status of selected family. Disabling will prevent the selected family from being used by other applications.
uk: Статус обраної сім'ї. Якщо вимкнути, вибране сімейство не буде використовуватися іншими програмами.

source: Collection Name
uk: Назва колекції

source: _Rename
uk: _Перейменувати

source: Add selected font to comparison
uk: Додати вибраний шрифт для порівняння

source: Remove selected font from comparison
uk: Вилучити вибраний шрифт із порівняння

source: Pinned Comparisons
uk: Закріплені порівняння

source: Cancel
uk: Скасувати

source: Search Families…
uk: Пошук сімей…

source: Search Orthographies…
uk: Пошук орфографії…

source: Minimum Coverage
uk: Мінімальне покриття

source: Deselect All
uk: Зняти вибір із усіх

source: Clear selected filter
uk: Очистити вибраний фільтр

source: Created :
uk: Створено :

source: Save current comparison
uk: Зберегти поточне порівняння

source: Remove selected comparison
uk: Видалити вибране порівняння

source: Restore selected comparison
uk: Відновити вибране порівняння

source: Select fonts to remove
uk: Виберіть шрифти, які потрібно видалити

source: Delete
uk: Видалити

source: Categories
uk: Категорії

source: Smart Collections
uk: Розумні колекції

source: Sort Order
uk: Порядок сортування

source: Collections
uk: Колекції

source: Enter target family
uk: Введіть цільову сім'ю

source: Add substitute
uk: Додати замінник

source: Remove substitute
uk: Видалити заміну

source: Enter substitute family
uk: Введіть замінну сім'ю

source: prefer
uk: віддають перевагу

source: accept
uk: прийнято

source: default
uk: за замовчуванням

source: Comment
uk: Коментар

source: Executable
uk: Виконуваний файл

source: Arguments
uk: Аргументи

source: Newest
uk: Найновіший

source: Most Popular
uk: Найпопулярніший

source: Trending
uk: В тренді

source: Serif
uk: Засічки

source: Sans Serif
uk: Без зарубок

source: Handwriting
uk: Почерк

source: Category
uk: Категорія

source: Variations
uk: Варіації

source: Preview font files before installing them.
uk: Перегляньте файли шрифтів перед їх встановленням.

source: To preview a font simply drag it onto this area.
uk: Щоб переглянути шрифт, просто перетягніть його в цю область.
