Repository: FontManager/font-manager
Catalog: po/*.po
Languages: uk

source: Font Manager
uk: Розпорядник шрифтів

source: A simple font management application for Gtk+ Desktop Environments
uk: Проста програма управління шрифтами для середовищ Gtk + Desktop

source: Font Manager is intended to provide a way for average users to easily manage desktop fonts, without having to resort to command line tools or editing configuration files by hand.
uk: Розпорядник шрифтів призначений для того, щоб пересічні користувачі могли легко керувати шрифтами робочого столу без необхідності вдаватися до інструментів командного рядка чи редагувати конфігураційні файли вручну.

source: While designed primarily with the Gnome Desktop Environment in mind, it should work well with other Gtk+ desktop environments.
uk: Незважаючи на те, що розроблено в першу чергу для робочого середовища Gnome, воно має добре працювати з іншими робочими середовищами Gtk+.

source: Font Manager is NOT a professional-grade font management solution.
uk: Розпорядник шрифтів НЕ є професійним рішенням для керування шрифтами.

source: Preview, Compare and Manage Fonts
uk: Попередній перегляд, порівняння та керування шрифтами

source: Graphics;Viewer;GNOME;GTK;Publishing;
uk: Графіка; Перегляд; GNOME; GTK; Публікація;

source: Font Viewer
uk: Переглядач шрифтів

source: A font viewer application for Gtk+ Desktop Environments
uk: Програма перегляду шрифтів для Gtk+ Desktop Environments

source: Font Viewer allows previewing font files prior to installation. It features several ways to preview font files along with a character map and displays font properties and license details.
uk: Засіб перегляду шрифтів дозволяє попередньо переглядати файли шрифтів перед установкою. Він пропонує кілька способів попереднього перегляду файлів шрифтів разом із картою символів і відображає властивості шрифту та деталі ліцензії.

source: Full featured font file preview application
uk: Повнофункціональна програма попереднього перегляду файлів шрифтів

source: Install
uk: Установити

source: Install the selected font file
uk: Установити вибраний файл шрифту

source: Install the selected font files
uk: Установити вибрані файли шрифтів

source: Font Properties
uk: Властивості шрифту

source: Updating Database…
uk: Оновлення бази даних…

source: Unknown Vendor
uk: Невідомий постачальник

source: Thin
uk: Тонкий

source: Ultra-Light
uk: Ультра-Світло

source: Light
uk: Світло

source: Semi-Light
uk: Напів-Світла

source: Book
uk: Книга

source: Medium
uk: Середній

source: Semi-Bold
uk: Напів-Жирний

source: Bold
uk: Жирний

source: Ultra-Bold
uk: Ультражирний

source: Heavy
uk: Важка

source: Ultra-Heavy
uk: Ультра-Важка

source: Italic
uk: Курсив

source: Oblique
uk: Косий

source: Ultra-Condensed
uk: Ультра-Ущільнений

source: Extra-Condensed
uk: Екстра-Ущільнений

source: Condensed
uk: Ущільнений

source: Semi-Condensed
uk: Напів-Ущільнений

source: Semi-Expanded
uk: Напів-Розширений

source: Expanded
uk: Розширений

source: Extra-Expanded
uk: Екстра-розширений

source: Ultra-Expanded
uk: Ультрарозширений

source: Proportional
uk: Пропорційний

source: Dual Width
uk: Подвійна ширина

source: Monospace
uk: Мінівен

source: Charcell
uk: Шарсель

source: Unknown
uk: Невідомий

source: None
uk: Немає

source: Slight
uk: Незначний

source: Full
uk: Повний

source: Default
uk: Стандартний

source: Legacy
uk: Спадщина

source: Source Unavailable
uk: Джерело недоступне

source: Simple font management for GTK+ desktop environments
uk: Просте керування шрифтами для настільних середовищ GTK+

source: translator-credits
uk: перекладач-кредити

source: Restricted License Embedding
uk: Вбудовування обмеженої ліцензії

source: Preview & Print Embedding
uk: Попередній перегляд і вбудовування для друку

source: Editable Embedding
uk: Вбудовування з можливістю редагування

source: Preview & Print Embedding | No Subsetting
uk: Вставлення попереднього перегляду та друку | Без піднабору

source: Editable Embedding | No Subsetting
uk: Вбудовування з можливістю редагування | Без піднабору

source: Preview & Print Embedding | Bitmap Embedding Only
uk: Вставлення попереднього перегляду та друку | Лише вбудовування растрового зображення

source: Editable Embedding | Bitmap Embedding Only
uk: Вбудовування з можливістю редагування | Лише вбудовування растрового зображення

source: Preview & Print Embedding | No Subsetting | Bitmap Embedding Only
uk: Вставлення попереднього перегляду та друку | Без піднабору | Лише вбудовування растрового зображення

source: Editable Embedding | No Subsetting | Bitmap Embedding Only
uk: Вбудовування з можливістю редагування | Без піднабору | Лише вбудовування растрового зображення

source: Installable Embedding
uk: Можливе вбудовування

source: File does not contain license information.
uk: Файл не містить інформації про ліцензію.

source: Left Aligned
uk: Вирівнювання по лівому краю

source: Centered
uk: По центру

source: Fill
uk: Заповнити

source: Right Aligned
uk: Вирівняно по правому краю

source: Edit preview text
uk: Редагувати текст попереднього перегляду

source: Undo changes
uk: Скасувати зміни

source: Preview
uk: Перегляд

source: Waterfall
uk: Водоспад

source: Characters
uk: Персонажі

source: Properties
uk: Властивості

source: License
uk: Ліцензія

source: Regular
uk: Регулярний

source: Normal
uk: Нормальний

source: Search available characters
uk: Пошук доступних символів

source: PostScript Name
uk: Назва PostScript

source: Family
uk: Сім'я

source: Style
uk: Стиль

source: Width
uk: Ширина

source: Slant
uk: Коса

source: Weight
uk: Вага

source: Spacing
uk: Інтервал

source: Version
uk: Версія

source: Vendor
uk: Продавець

source: Filesize
uk: Розмір файлу

source: Copy
uk: Копіювати

source: <Non Private Use High Surrogate>
uk: <Високий сурогат не для приватного використання>

source: <Private Use High Surrogate>
uk: <Високий сурогат приватного користування>

source: <Low Surrogate>
uk: <Низький Сурогат>

source: <Private Use>
uk: <Приватне використання>

source: <Plane 15 Private Use>
uk: <Літак 15 приватного користування>

source: <Plane 16 Private Use>
uk: <Літак 16 приватного користування>

source: <not assigned>
uk: <не призначено>

source: Other, Control
uk: Інше, Контроль

source: Other, Format
uk: Інше, Формат

source: Other, Not Assigned
uk: Інше, не призначено

source: Other, Private Use
uk: Інше, приватне використання

source: Other, Surrogate
uk: Інше, Сурогат

source: Letter, Lowercase
uk: Літера, мала буква

source: Letter, Modifier
uk: Літера, модифікатор

source: Letter, Other
uk: Лист, інше

source: Letter, Titlecase
uk: Лист, регістр

source: Letter, Uppercase
uk: Літера, Велика

source: Mark, Spacing Combining
uk: Позначка, поєднання інтервалів

source: Mark, Enclosing
uk: Марк, Вкладення

source: Mark, Non-Spacing
uk: Марк, без пробілів

source: Number, Decimal Digit
uk: Число, десяткова цифра

source: Number, Letter
uk: Число, буква

source: Number, Other
uk: Номер, інше

source: Punctuation, Connector
uk: Розділові знаки, сполучник

source: Punctuation, Dash
uk: Розділові знаки, тире

source: Punctuation, Close
uk: Розділові знаки, Закрити

source: Punctuation, Final Quote
uk: Розділові знаки, кінцева цитата

source: Punctuation, Initial Quote
uk: Розділові знаки, початкова цитата

source: Punctuation, Other
uk: Пунктуація, інше

source: Punctuation, Open
uk: Розділові знаки, відкрити

source: Symbol, Currency
uk: Символ, валюта

source: Symbol, Modifier
uk: Символ, модифікатор

source: Symbol, Math
uk: Символ, мат

source: Symbol, Other
uk: Символ, інше

source: Separator, Line
uk: Роздільник, лінія

source: Separator, Paragraph
uk: Роздільник, абзац

source: Separator, Space
uk: Роздільник, пробіл

source: Up to 48 points (Linear Scaling)
uk: До 48 точок (лінійне масштабування)

source: Up to 72 points (1.1 Common Ratio)
uk: До 72 балів (загальний коефіцієнт 1,1)

source: Up to 96 points (Linear Scaling)
uk: До 96 точок (лінійне масштабування)

source: Up to 96 points (1.1 Common Ratio)
uk: До 96 балів (загальний коефіцієнт 1,1)

source: Up to 120 points (1.2 Common Ratio)
uk: До 120 балів (загальний коефіцієнт 1,2)

source: Up to 144 points (1.3 Common Ratio)
uk: До 144 балів (загальний коефіцієнт 1,3)

source: Up to 192 points (1.4 Common Ratio)
uk: До 192 балів (загальний коефіцієнт 1,4)

source: Custom Size Settings
uk: Налаштування спеціального розміру

source: Waterfall Preview Size Settings
uk: Параметри розміру попереднього перегляду водоспаду

source: Higher values may adversely affect performance
uk: Вищі значення можуть негативно вплинути на продуктивність

source: Minimum Waterfall Preview Point Size
uk: Мінімальний розмір точки попереднього перегляду водоспаду

source: Waterfall Preview Point Size Common Ratio
uk: Загальне співвідношення розміру точки попереднього перегляду водоспаду

source: Maximum Waterfall Preview Point Size
uk: Максимальний розмір точки попереднього перегляду водоспаду

source: Show line size
uk: Показати розмір лінії

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/gpl-3.0.txt>.
uk: Ця програма є безкоштовним програмним забезпеченням: ви можете поширювати її та/або змінювати згідно з умовами Загальної публічної ліцензії GNU, опублікованої Free Software Foundation, або версія 3 Ліцензії, або (на ваш вибір) будь-яка пізніша версія. Ця програма розповсюджується в надії, що вона буде корисною, але БЕЗ ЖОДНИХ ГАРАНТІЙ; навіть без неявної гарантії КОМЕРЦІЙНА ПРИДАТНІСТЬ або ПРИДАТНІСТЬ ДЛЯ КОНКРЕТНОЇ МЕТИ. Див Загальна публічна ліцензія GNU для отримання додаткової інформації. Ви повинні були отримати копію GNU General Public License разом із цією програмою. Якщо ні, перегляньте <http://www.gnu.org/licenses/gpl-3.0.txt>.

source: Installing Font Files…
uk: Встановлення файлів шрифтів…

source: Active
uk: Активний

source: Inactive
uk: Неактивний

source: Designed by
uk: Розроблено

source: Grouped by font width
uk: Згруповано за шириною шрифту

source: Grouped by font weight
uk: Згруповано за щільністю шрифту

source: Grouped by font angle
uk: Згруповано за кутом нахилу шрифту

source: Grouped by font spacing
uk: Згруповано за міжшрифтовим інтервалом

source: Grouped by license type
uk: Згруповано за типом ліцензії

source: Grouped by vendor
uk: Згруповано за постачальником

source: Filetype
uk: Тип файлу

source: Grouped by filetype
uk: Згруповано за типом файлу

source: All
uk: Всі

source: All Fonts
uk: Всі шрифти

source: System
uk: Система

source: Fonts available to all users
uk: Шрифти доступні всім користувачам

source: Family Kind
uk: Сімейний вид

source: Only fonts which include Panose information will be grouped here.
uk: Тут буде згруповано лише шрифти, які містять інформацію Panose.

source: Any
uk: Будь-який

source: No Fit
uk: Не підходить

source: Text and Display
uk: Текст і дисплей

source: Script
uk: Сценарій

source: Decorative
uk: Декоративний

source: Pictorial
uk: Живописний

source: Enter Collection Name
uk: Введіть назву колекції

source: Copy to…
uk: Копіювати до…

source: Compress…
uk: Компрес…

source: Rename…
uk: Перейменувати…

source: Archive created successfully.
uk: Архів успішно створено.

source: The resulting file can be found in your home directory.
uk: Отриманий файл можна знайти у вашому домашньому каталозі.

source: Error exporting collection
uk: Помилка експорту колекції

source: Start the application from a terminal and try again for more information
uk: Запустіть програму з терміналу та повторіть спробу, щоб отримати додаткову інформацію

source: Creating archive from selected collection.
uk: Створення архіву з вибраної колекції.

source: This may take some time for large collections…
uk: Це може зайняти деякий час для великих колекцій…

source: Saved Comparison
uk: Збережене порівняння

source: Save the current comparison by clicking the + button
uk: Зберегти поточне порівняння натиснувши кнопку +

source: Keyboard Shortcuts
uk: Комбінації клавіш

source: Help
uk: Довідка

source: About Font Manager
uk: Про менеджер шрифтів

source: Preferences
uk: Уподобання

source: Import
uk: Імпорт

source: Export
uk: Експорт

source: User Data
uk: Дані користувача

source: Name
uk: Ім'я

source: Size
uk: Розмір

source: Grid View
uk: Перегляд сітки

source: List View
uk: Перегляд списку

source: Add Fonts
uk: Додати шрифти

source: Remove Fonts
uk: Видалити шрифти

source: Back
uk: Назад

source: _Select
uk: _Вибрати

source: Select Executable
uk: Виберіть Виконуваний файл

source: Select a Directory
uk: Виберіть каталог

source: Archive Files
uk: Архівні файли

source: Select Files to Install
uk: Виберіть Файли для встановлення

source: Select Source Directories
uk: Виберіть вихідні каталоги

source: Font Configuration
uk: Конфігурація шрифту

source: Font Collections
uk: Колекції шрифтів

source: Font Sources
uk: Джерела шрифтів

source: Installed Fonts
uk: Встановлені шрифти

source: Custom Actions
uk: Спеціальні дії

source: Fonts installed in your home directory will appear here.
uk: Тут з’являться шрифти, встановлені у вашому домашньому каталозі.

source: Case insensitive search of family names. Start search using %s to filter based on filepath. Start search using %s to filter based on characters.
uk: Пошук прізвищ без урахування регістру. Почніть пошук за допомогою %s для фільтрації на основі шляху до файлу. Почніть пошук за допомогою %s для фільтрації за символами.

source: %i Variation
uk: %i Варіація

source: Collapse all
uk: Згорнути все

source: Expand all
uk: Розгорнути все

source: Copy Location
uk: Копіювати місцезнаходження

source: Show in Folder
uk: Показати в папці

source: Enable selected items
uk: Увімкнути вибрані елементи

source: Disable selected items
uk: Вимкнути вибрані елементи

source: %i selected item
uk: %i вибраний елемент

source: Actions
uk: Дії

source: Browse
uk: Переглядати

source: Compare
uk: Порівняйте

source: Google Fonts
uk: Шрифти Google

source: Manage
uk: Керувати

source: Afrikaans
uk: Африканський

source: Ahom
uk: Ахом

source: Aleut Cyrillic
uk: Алеутська кирилиця

source: Aleut Latin
uk: Алеутська лат

source: Arabic
uk: Арабська

source: Archaic Greek Letters
uk: Архаїчні грецькі літери

source: Armenian
uk: Вірменський

source: Astronomy
uk: Астрономія

source: Balinese
uk: Балійська

source: Baltic
uk: Балтійський

source: Bamum
uk: Бамум

source: Basic Cyrillic
uk: Основна кирилиця

source: Basic Greek
uk: Основна грецька

source: Basic Latin
uk: Основна лат

source: Surat Batak
uk: Батакський лист

source: Bengali
uk: Бенгальська

source: Brāhmī
uk: Брахмі

source: Buginese
uk: Бугійський

source: Unified Canadian Aboriginal Syllabics
uk: Уніфікована силабіка канадських аборигенів

source: Carian
uk: Пошук

source: Catalan
uk: Каталонська

source: Central European
uk: Центральноєвропейський

source: Chakma
uk: Чакма

source: Cham
uk: Чам

source: Cherokee
uk: Черокі

source: Chess Symbols
uk: Шахові символи

source: CJK Unified
uk: CJK Уніфікований

source: CJK Unified Extension A
uk: Уніфіковане розширення CJK A

source: CJK Unified Extension B
uk: Уніфіковане розширення CJK B

source: CJK Unified Extension C
uk: Уніфіковане розширення CJK C

source: CJK Unified Extension D
uk: Уніфіковане розширення CJK D

source: CJK Unified Extension E
uk: Уніфіковане розширення CJK E

source: CJK Compatibility Ideographs
uk: Ідеографії сумісності CJK

source: CJK Compatibility Ideographs Supplement
uk: Доповнення до ідеографів сумісності CJK

source: Claudian Letters
uk: Листи Клавдія

source: Coptic
uk: Коптська

source: Currencies
uk: Валюти

source: Cypriot Syllabary
uk: Кіпрська складова буква

source: Devanagari
uk: Деванагарі

source: Dutch
uk: Голландська

source: Egyptian Hieroglyphs
uk: Єгипетські ієрогліфи

source: Emoticons
uk: Смайлики

source: Ethiopic
uk: Ефіопський

source: Farsi
uk: Фарсі

source: Food and Drink
uk: Їжа та напої

source: Full Cyrillic
uk: Повна кирилиця

source: Georgian
uk: Грузинський

source: Glagolitic
uk: Глаголиця

source: Gothic
uk: Готика

source: Gujarati
uk: Гуджараті

source: Gurmukhi
uk: Гурмухі

source: Korean Hangul
uk: Корейський хангиль

source: Hanunó'o
uk: Хануноо

source: Hebrew
uk: Іврит

source: Igbo Onwu
uk: Ігбо Онву

source: Korean Jamo
uk: Корейська Джамо

source: Javanese
uk: Яванський

source: Japanese Jinmeiyo
uk: Японський Jinmeiyo

source: Japanese Joyo
uk: Японська радість

source: Kaithi
uk: Каїті

source: Japanese Kana
uk: Японське Кано

source: Kannada
uk: Каннада

source: Kayah Li
uk: Кая Лі

source: Kazakh
uk: Казахська

source: Kharoshthi
uk: Харошті

source: Khmer
uk: Кхмерська

source: Japanese Kokuji
uk: Японський Кокудзі

source: Lao
uk: Лао

source: Latin Ligatures
uk: Латинські лігатури

source: Lepcha
uk: Лепча

source: Limbu
uk: Лімбу

source: Linear B Ideograms
uk: Лінійні B ідеограми

source: Linear B Syllabary
uk: Лінійний Б Складовий алфавіт

source: Malayalam
uk: Малаялам

source: Mathematical Greek
uk: Математичний грец

source: Mathematical Latin
uk: Математична лат

source: Mathematical Numerals
uk: Математичні цифри

source: Mathematical Operators
uk: Математичні оператори

source: Meetei Mayak
uk: Метей Маяк

source: Mende Kikakui
uk: Менде Кікаку

source: MeroiticCursive
uk: Мероїтичний курсив

source: Meroitic Hieroglyphs
uk: Мероїтичні ієрогліфи

source: Miao
uk: Мяо

source: Mongolian
uk: Монгольська

source: Myanmar
uk: М'янма

source: New Tai Lue
uk: Новий Тай Лу

source: N’Ko
uk: Нко

source: Ogham
uk: Огам

source: Ol Chiki
uk: Оль Чикі

source: Old Italic
uk: Старий Italic

source: Old South Arabian
uk: Давньоаравійський

source: Oriya
uk: Орія

source: Osmanya
uk: Османія

source: Pan African Latin
uk: Панафриканська латиниця

source: Pashto
uk: Пушту

source: Phags Pa
uk: Фагс Па

source: Pinyin
uk: Піньїнь

source: Polynesian
uk: Полінезійський

source: Polytonic Greek
uk: Політонічна грецька

source: Rejang
uk: Реджанг

source: Romanian
uk: Румунська

source: Runic
uk: Рунічний

source: Saurashtra
uk: Саураштра

source: Simplified Chinese
uk: Спрощена китайська

source: Sindhi
uk: Сіндхі

source: Sinhala
uk: Сингальська

source: South Korean Hanja
uk: Південнокорейська ханджа

source: Sundanese
uk: Сунданська

source: Syloti Nagri
uk: Сілоті Нагрі

source: Syriac
uk: Сирійська

source: Tai Le
uk: Тай Ле

source: Tai Tham (Lanna)
uk: Тай Тхам (Ланна)

source: Tai Viet
uk: Тай В'єт

source: Tamil
uk: Тамільська

source: Telugu
uk: Телугу

source: Thaana
uk: Тана

source: Thai
uk: Тайська

source: Tibetan
uk: Тибетська

source: Tifinagh
uk: Тіфінаг

source: Traditional Chinese
uk: Традиційна китайська

source: Turkish
uk: Турецька

source: Uighur
uk: Уйгурський

source: Urdu
uk: Урду

source: Vai
uk: Ваі

source: Vedic Extensions
uk: Ведичні розширення

source: Venda
uk: Розпродаж

source: Vietnamese
uk: В'єтнамська

source: Western European
uk: Західноєвропейський

source: Yi
uk: Я

source: Chinese Zhuyin Fuhao
uk: Китайський Чжуїнь Фухао

source: Coverage
uk: Покриття

source: Supported Orthographies
uk: Підтримувані орфографії

source: No items selected
uk: Елементи не вибрано

source: Update in progress
uk: Виконується оновлення

source: No valid orthographies for selection
uk: Немає дійсних орфографій для вибору

source: Add new collection
uk: Додати нову колекцію

source: Remove selected item
uk: Видалити вибраний елемент

source: Edit selected item
uk: Редагувати вибраний елемент

source: Copying files…
uk: Копіювання файлів…

source: New Collection
uk: Нова колекція

source: Created : %s
uk: Створено : %s

source: Disabled
uk: Вимкнено

source: Fonts which have been disabled
uk: Шрифти, які були вимкнені

source: Filter based on supported orthographies
uk: Фільтр на основі підтримуваної орфографії

source: Unsorted
uk: Несортований

source: Fonts not present in any collection
uk: Шрифти відсутні в жодній колекції

source: User
uk: Користувач

source: Fonts available only to you
uk: Шрифти, доступні тільки вам

source: Interface Font
uk: Шрифт інтерфейсу

source: Font used throughout interface.
uk: Шрифт, який використовується в інтерфейсі.

source: Document Font
uk: Шрифт документа

source: Font used for reading documents.
uk: Шрифт, який використовується для читання документів.

source: Monospace Font
uk: Моноширинний шрифт

source: Monospaced (fixed-width) font for use in locations such as terminals.
uk: Моноширинний шрифт (з фіксованою шириною) для використання в таких місцях, як термінали.

source: Text Scaling Factor
uk: Коефіцієнт масштабування тексту

source: Factor used to enlarge or reduce text display, without changing font size
uk: Фактор, який використовується для збільшення або зменшення відображення тексту без зміни розміру шрифту

source: GTK 4 Font Rendering
uk: Відтворення шрифтів GTK 4

source: Automatic option allows GTK 4 to disregard hinting settings.
uk: Автоматична опція дозволяє GTK 4 ігнорувати налаштування підказок.

source: Antialiasing
uk: Згладжування

source: The type of antialiasing to use when rendering fonts. Note : Starting with GTK 4 RGBA is no longer used, only None and Grayscale are valid values.
uk: Тип згладжування для використання під час відтворення шрифтів. Примітка. Починаючи з GTK 4 RGBA більше не використовується, дійсними значеннями є лише значення None і Grayscale.

source: RGBA order
uk: Замовлення РГБА

source: The order of subpixel elements on an LCD screen; only used when antialiasing is set to rgba.
uk: Порядок субпіксельних елементів на рідкокристалічному екрані; використовується лише тоді, коли для згладжування встановлено значення rgba.

source: Hinting
uk: Підказка

source: The type of hinting to use when rendering fonts.
uk: Тип підказки для використання під час відтворення шрифтів.

source: The type of antialiasing to use when rendering fonts. Note : Starting with GTK 4 RGBA is no longer used, only None and Grayscale are valid values.
uk: Тип згладжування для використання під час відтворення шрифтів. Примітка. Починаючи з GTK 4 RGBA більше не використовується, дійсними значеннями є лише значення None і Grayscale.

source: GNOME desktop settings schema not found
uk: Схему налаштувань робочого столу GNOME не знайдено

source: Automatic
uk: Автоматичний

source: Manual
uk: Інструкція

source: Grayscale
uk: Відтінки сірого

source: Subpixel Geometry
uk: Субпіксельна геометрія

source: Target DPI
uk: Цільовий DPI

source: Scale Factor
uk: Фактор масштабу

source: LCD Filter
uk: РК-фільтр

source: Interface
uk: Інтерфейс

source: Desktop
uk: Робочий стіл

source: Sources
uk: Джерела

source: Substitutions
uk: Заміни

source: Display
uk: Дисплей

source: Rendering
uk: Візуалізація

source: A Fontconfig configuration file will be generated from these settings. Running applications may require a restart to reflect any changes. Note that not all environments/applications will honor these settings.
uk: Файл конфігурації Fontconfig буде згенеровано з цих параметрів. Запущені програми можуть вимагати перезавантаження, щоб відобразити будь-які зміни. Зауважте, що не всі середовища/програми підтримуватимуть ці налаштування.

source: Reset all values to default
uk: Скинути всі значення до стандартних

source: Antialias
uk: Анталія

source: Enable Autohinter
uk: Увімкнути Autohinter

source: Hinting Style
uk: Стиль підказки

source: Use Embedded Bitmaps
uk: Використовуйте вбудовані растрові зображення

source: Font Substitutions
uk: Заміна шрифту
